// SЗадача 26: Напишите программу, которая принимает
//на вход число и выдаёт количество цифр в числе.

Console.Write("Enter any integer number: ");